Revit 2024 API
ParameterTypeId.RoofCurveHeightOffset Property
 "Offset From Roof Base"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RoofCurveHeightOffset { get; }
Visual Basic
Public Shared ReadOnly Property RoofCurveHeightOffset As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RoofCurveHeightOffset {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace